Repository: UnigramDev/Unigram
Catalog: Unigram/Unigram/Strings/*/Resources.resw
Source language: en
Languages: ar, be, ca, de, es, fa, fi, fr, id, it, ko, ms, nl, pl, pt_br, ru, sv, tr, uk, uz, zh_cn, zh_tw

# LinkNameHint
source: Link Name (Optional)
ar: اسم الرابط (اختياري)
be: Назва спасылкі (неабавязкова)
ca: Nom de l'enllaç (opcional)
de: Name des Links (Optional)
es: Nombre del enlace (opcional)
fi: Linkin nimi (valinnainen)
fr: Nom du lien (facultatif)
it: Nome link (opzionale)
ko: 링크 이름 (선택)
ms: Nama Link (Pilihan)
pl: Nazwa linku (opcjonalnie)
pt_br: Nome do Link (Opcional)
ru: Название (необязательно)
sv: Länknamn (frivilligt)
tr: Bağlantı Adı (İsteğe bağlı)
uk: Назва посилання (необовʼязково)

# LinkNotFound
source: Unfortunately, you can't access this message. You are not a member of the chat where it was posted.
ar: للأسف، لا يمكنك الوصول إلى هذه الرسالة؛ لأنك لست عضوًا في المحادثة التي تم نشر الرسالة فيها.
be: На жаль, у вас няма доступу да гэтага паведамлення. Вы не з'яўляецеся ўдзельнікам чата ў якім яно было размешчана.
ca: No podeu accedir a aquest missatge. No sou membre del xat on es va publicar.
de: Leider kannst du auf diese Nachricht nicht zugreifen. Du bist kein Mitglied des Chats, in dem sie veröffentlicht wurde.
es: Lamentablemente, no puedes acceder a este mensaje. No eres miembro del chat en el que fue publicado.
fa: متأسفانه شما نمی‌توانید به این پیام دسترسی پیدا کنید. شما عضو گفتگویی که این پیام در آن ارسال شده است، نیستید.
fi: Valitettavasti et voi nähdä tätä viestiä, koska et ole jäsen siinä keskustelussa johon se lähetettiin.
fr: Malheureusement, vous ne pouvez pas accéder à ce message. Vous n’êtes pas membre de l’échange dans lequel il a été publié.
id: Sayangnya, Anda tidak dapat mengakses pesan ini. Anda bukan anggota obrolan grup di mana pesan dikirim.
it: Sfortunatamente, non puoi accedere a questo messaggio. Non sei membro della chat in cui è stato pubblicato.
ko: 안타깝게도 이 메시지에 접근하실 수 없습니다. 회원님은 메시지가 게시된 대화방의 참가자가 아닙니다.
ms: Malangnya anda tak boleh akses mesej ini. Anda bukan ahli bual di mana ianya dipos.
nl: Je kunt dit bericht niet openen omdat je geen lid bent van de chat waar dit bericht is geplaatst.
pl: Niestety, nie możesz uzyskać dostępu do tej wiadomości. Nie jesteś członkiem czatu, w którym została ona opublikowana.
pt_br: Desculpe, você não faz parte da conversa em que essa mensagem foi postada e infelizmente não pode acessá-la.
ru: К сожалению, Вы не состоите в чате, где было опубликовано это сообщение.
sv: Tyvärr kan du inte komma åt det här meddelandet. Du är inte medlem i chatten den skickades i.
tr: Üzgünüz, bu mesaja erişemezsiniz. Yayınlanan bu sohbetin bir üyesi değilsiniz.
uk: Ви не є учасником чату, де опубліковане це повідомлення.
uz: Afsuski, siz bu xabarga kira olmaysiz. Chunki, siz xabar joylashtirilgan chat aʼzosi emassiz.

source: Link preview
ar: معاينة الرابط
be: Перадпрагляд спасылкі
ca: Vista prèvia de l'enllaç
de: Linkvorschau
es: Vista previa del enlace
fa: پیش‌نمایش لینک
fi: Linkin esikatselu
fr: Aperçu du lien
id: Pratinjau tautan
it: Anteprima link
ko: 링크 미리보기
ms: Link pratonton
nl: Link-voorbeeld
pl: Podgląd linku
pt_br: Prévia do link
ru: Предпросмотр ссылки
sv: Förhandsvisning av länken
tr: Bağlantı önizlemesi
uk: Попередній перегляд посилання
uz: Havolaga razm solish
zh_cn: 链接预览
zh_tw: 鏈結預覽

# Links_one
source: {0} link
ar: رابط واحد
be: {0} спасылка
ca: {0} enllaç
es: {0} enlace
fi: {0} linkki
fr: {0} lien
ru: {0} ссылка
sv: {0} länk
tr: {0} bağlantı
uk: {0} посилання

# Links_other
source: {0} links
ar: ⁨{0}⁩ رابط
be: {0} спасылкі
ca: {0} enllaços
es: {0} enlaces
fi: {0} linkkiä
fr: {0} liens
it: {0} link
ko: 링크 {0}개
ms: {0} link
pl: {0} linku
ru: {0} ссылок
sv: {0} länkar
tr: {0} bağlantı
uk: {0} посилань

source: Links created by other admins
ar: الروابط التي أنشأها المشرفون
be: Спасылкі, створаныя іншымі кіраўнікамі
ca: Enllaços d'altres administradors
de: Links von anderen Admins
es: Enlaces creados por otros admins.
fi: Muiden valvojien luomat linkit
fr: Liens créés par d'autres administrateurs
it: Link creati da altri amministratori
ko: 다른 관리자가 만든 링크
ms: Link jemputan dicipta oleh pentadbir lain
nl: Uitnodigingslinks van andere beheerders
pl: Linki utworzone przez innych administratorów
pt_br: Links criados por outros admins
ru: Ссылки других администраторов
sv: Länkar av andra administratörer
tr: Diğer yöneticilerin oluşturduğu bağlantılar
uk: Посилання від інших адміністраторів

# LinksCreatedByThisAdmin
source: Invite links created by this admin
ar: روابط الدعوة التي أنشأها هذا المشرف
be: Спасылкі створаныя гэтым кіраўніком
ca: Enllaços creats per aquest administrador
de: Einladungslinks von diesem Admin
es: Enlaces creados por este admin.
fi: Tämän valvojan luomat kutsulinkit
fr: Liens d'invitation créés par cet admin
it: Link creati da questo amministratore
ko: 이 관리자가 생성한 초대링크
ms: Link jemputan dicipta oleh pentadbir ini
nl: Uitnodigingslinks gemaakt door deze beheerder
pl: Linki zaproszeń utworzone przez tego administratora
pt_br: Links de convite criados por esse admin
ru: Ссылки, созданные администратором
sv: Inbjudningslänkar skapade av denna admin.
tr: Bu yönetici tarafından oluşturulan davet bağlantıları
uk: Посилання від цього адміністратора

# LinksTitle
source: Shared Links
ar: الروابط المتبادلة
be: Абагуленыя спасылкі
ca: Enllaços compartits
de: Geteilte Links
es: Enlaces
fa: لینک‌های اشتراکی
fi: Jaetut linkit
fr: Liens partagés
id: Tautan Bersama
it: Link condivisi
ko: 공유한 링크
ms: Link Kongsi
nl: Gedeelde links
pl: Udostępnione linki
pt_br: Links Compartilhados
ru: Общие ссылки
sv: Delade länkar
tr: Paylaşılan Bağlantılar
uk: Поширені посилання
uz: Ulashilgan havolalar
zh_cn: 分享的链接
zh_tw: 分享的鏈結

source: listening
ar: يستمع
be: слухае
ca: està escoltant
de: hört zu
es: escuchando
fi: kuuntelee
fr: à l'écoute
it: sta ascoltando
ko: 듣는 중
ms: mendengar
nl: aan het luisteren
pl: słucha
pt_br: escutando
ru: слушает
sv: lyssnar
tr: dinliyor
uk: слухає

# LiveLocationAlertGroup
source: Choose for how long people in this chat will see your live location.
ar: اختيار المدة التي سيتمكن فيها أعضاء هذه المحادثة من مشاهدة موقعك الدقيق، بما في ذلك عندما يكون التطبيق مغلقًا.
be: Выберыце, як доўга ўдзельнікі чата будуць бачыць ваша дакладнае месцазнаходжанне.
ca: Trieu el temps que la gent d'aquest xat veurà la vostra ubicació.
de: Wähle, wie lange Leute in diesem Chat deinen Live-Standort sehen dürfen.
es: Elige durante cuánto tiempo las personas de este chat verán tu ubicación en tiempo real.
fa: انتخاب کنید که تا چه مدت افراد در این گفتگو بتوانند موقعیت مکانی لحظه‌ای شما را ببینند.
fi: Valitse, kuinka pitkään tämä keskustelu saa nähdä live-sijaintisi, vaikka sovellus ei olisi edustalla.
fr: Pour combien de temps voulez-vous partager votre position dans cet échange ?
id: Pilih berapa lama anggota di obrolan ini dapat melihat lokasi langsung Anda.
it: Scegli per quanto le persone in questa chat vedranno la tua posizione in tempo reale.
ko: 이 대화방 사람들에게 회원님의 실시간 위치를 얼마 동안 보일지 선택하세요.
ms: Pilih berapa lama orang dalam bual ini akan dapat lihat lokasi langsung anda.
nl: Kies hoelang je je Live-locatie met mensen in deze chat wilt delen.
pl: Wybierz, jak długo ludzie w tym czacie będą widzieć twoją „Lokalizację na żywo”.
pt_br: Escolha por quanto tempo as pessoas nesse chat irão ver a sua localização ao vivo.
ru: Выберите, как долго участники этого чата смогут видеть, где Вы находитесь.
sv: Bestäm hur länge medverkande i chatten kan se din precisa plats efter att appen stängts.
tr: Bu sohbetteki kişilerin canlı konumunuzu ne kadar süre göreceğini seçin.
uk: Скільки часу учасники чату бачитимуть ваше точне розташування?
uz: Ushbu suhbatdoshlaringiz jonli manzilingizni qancha vaqt davomida koʻrishi mumkinligini tanlang.
zh_cn: 选择此对话的成员在多长时间内可看到您实时位置信息。
zh_tw: 選擇此對話的成員在多長時間内可看到您即時位置訊息。

# LiveLocationAlertPrivate
source: Choose for how long {0} will see your accurate location.
ar: اختيار المدة التي سيرى فيها ⁨{0}⁩ موقعك الدقيق، بما في ذلك عند إغلاقك للتطبيق.
be: Выберыце, як доўга {0} будзе бачыць ваша дакладнае месцазнаходжанне.
ca: Trieu quant de temps podrà {0} veure la vostra ubicació.
de: Wähle, wie lange {0} deinen Live-Standort sehen darf.
es: Elige durante cuánto tiempo {0} verá tu ubicación exacta.
fa: انتخاب کنید که تا چه مدت ⁨{0}⁩ بتواند موقعیت مکانی دقیق شما را ببیند.
fi: Valitse, kuinka kauan {0} näkee tarkan sijaintisi, vaikka sovellus ei olisi edustalla.
fr: Pour combien de temps voulez-vous partager votre position avec {0} ?
id: Pilih berapa lama {0} dapat melihat lokasi akurat Anda.
it: Scegli per quanto {0} vedrà la tua posizione precisa.
ko: {0} 님에게 회원님의 정확한 위치를 얼마 동안 보일지 선택하세요.
ms: Pilih berapa lama {0} akan melihat lokasi tepat anda.
nl: Kies hoelang je je nauwkeurige locatie met {0} wilt delen.
pl: Wybierz, jak długo {0} będzie widzieć twoją dokładną lokalizację.
pt_br: Escolha por quanto tempo {0} verá sua localização precisa.
ru: Укажите, в течение какого времени {0} будет видеть Ваше актуальное местоположение.
sv: Ange hur länge {0} kan se din plats, även när appen är i stängd.
tr: Mevcut konumunuzun {0} kişisine ne kadar süreyle görüneceğini seçin
uk: Виберіть, скільки часу {0} бачитиме ваше точне розташування.
uz: {0} aniq joylashuvingizni qancha vaqt koʻrib turishini tanlang.
zh_cn: 选择“{0}”在多长时间内可看到您的精确位置信息。
zh_tw: 選擇“{0}”在多長時間内可看到您的即時位置訊息。

# LiveLocationContext
source: Live Location
ar: الموقع المباشر
be: Трансляцыя
ca: Ubicació en directe
de: Live-Standort
es: En tiempo real
fa: موقعیت‌ مکانی لحظه‌ای
fi: Live-sijainti
fr: Position en temps réel
id: Lokasi Langsung
it: Posizione in tempo reale
ko: 실시간 위치
ms: Lokasi Langsung
nl: Live-locatie
pl: Lokalizacja na żywo
pt_br: Localização Ao Vivo
ru: Трансляция геопозиции
sv: Liveplats
tr: Canlı Konum
uk: Маячок
uz: Jonli joylashuv

source: Live locations
ar: المواقع الحية
be: Трансляцыі месцазнаходжання
ca: Ubicacions en directe
de: Live-Standorte
es: Ubicaciones en tiempo real
fa: موقعیت‌های مکانی لحظه‌ای
fi: Live-sijainnit
fr: Positions en temps réel
id: Lokasi Langsung
it: Posizioni in tempo reale
ko: 실시간 위치
ms: Lokasi langsung
nl: Live-locaties
pl: Lokalizacja na żywo
pt_br: Localizações Ao Vivo
ru: Трансляции геопозиции
sv: Liveplatser
tr: Canlı konumlar
uk: Маячки
uz: Jonli joylashuvlar
zh_cn: 实时位置信息
zh_tw: 即時位置訊息

source: Loading...
ar: يتم التحميل...
be: Загрузка...
ca: S'està carregant...
de: Lädt…
es: Cargando...
fa: در حال بارگذاری...
fi: Ladataan...
fr: Chargement…
id: Memuat...
it: Carico...
ko: 불러오는 중...
ms: Sedang muat...
nl: Bezig met laden
pl: Wczytywanie…
pt_br: Carregando...
ru: Загрузка...
sv: Läser in...
tr: Yükleniyor…
uk: Завантаження...
uz: Yuklanmoqda...
zh_cn: 加载中……
zh_tw: 加載中……

source: loading full image...
ar: يتم تحميل الصورة...
be: загрузка поўнага відарыса...
ca: s'està carregant la imatge...
de: vollständiges Bild wird geladen...
es: cargando imagen completa…
fa: در حال بارگذاری تصویر کامل...
fi: ladataan koko kuvaa...
fr: chargement de l'image entière...
id: memuat gambar penuh...
it: carico l'immagine completa...
ko: 이미지 전체 불러오는 중...
ms: memuat imej penuh...
nl: afbeelding laden...
pl: wczytywanie pełnego obrazu…
pt_br: carregando imagem completa...
ru: загрузка в полном размере...
sv: hämtar fullstor bild...
tr: tam resim yükleniyor…
uk: завантаження в повному розмірі...
uz: toʻliq rasm yuklanmoqda...

source: Loading stats...
ar: يتم تحميل الإحصاءات...
be: Загрузка статыстыкі...
ca: S'estan carregant...
de: Lade Statistiken...
es: Cargando estadísticas…
fa: در حال بارگذاری آمار...
fi: Ladataan tilastoja...
fr: Chargement des statistiques...
id: Memuat statistik...
it: Carico le statistiche...
ko: 통계 불러오는 중...
ms: Memuat stattistik...
nl: Statistieken laden...
pl: Wczytywanie statystyk…
pt_br: Carregando estatísticas...
ru: Загрузка статистики...
sv: Läser in statistik...
tr: İstatistikler yükleniyor…
uk: Завантаження статистики...
uz: Statistika yuklanmoqda...

# LoadingStatsDescription
source: Please wait a few moments while we are generating graphs.
ar: يرجى الانتظار قليلًا ريثما نقوم بإنشاء إحصائياتك.
be: Крыху пачакайце, пакуль мы ствараем графікі.
ca: Espereu uns moments mentre generem els diagrames.
de: Bitte warte einen Augenblick, Diagramme werden erstellt.
es: Espera un momento mientras generamos los gráficos.
fa: لطفاً تا زمان تولید نمودارها چند لحظه صبر کنید.
fi: Odota hetki, luodaan kaavioita...
fr: Veuillez patienter pendant que nous générons les graphiques.
id: Mohon tunggu beberapa saat sementara kami membuat grafik.
it: Per favore attendi qualche momento mentre generiamo i grafici.
ko: 그래프를 만드는 동안 잠시 기다려 주세요
ms: Sila tunggu beberapa ketika sementara kami membina graf.
nl: Wacht even terwijl we grafieken genereren
pl: Poczekaj chwilę, aż wygenerujemy statystyki.
pt_br: Por favor, aguarde um momento enquanto geramos os gráficos.
ru: Создание графиков может занять некоторое время.
sv: Vänta en stund medan vi genererar din statistik.
tr: Grafikler oluşturulurken birkaç dakika bekleyin.
uk: Генеруються діаграми. Будь ласка, трохи зачекайте.
uz: Grafikni hosil qilgunimizcha biroz kuting.

# LocalAudioCache
source: Voice & Video messages
ar: الرسائل الصوتية والمرئية
be: Галасавыя і відэапаведамленні
ca: Missatges de veu i vídeo
de: Sprach- & Videonachrichten
es: Mensajes de voz y video
fi: Ääni- ja videoviestit
fr: Messages vidéo/vocaux
it: Vocali e videomessaggi
ko: 음성 및 영상 메시지
ms: Mesej Suara & Video
nl: Spraak- en videoberichten
pl: Wiadomości głosowe i wideo
pt_br: Mensagens voz e vídeo
ru: Аудио/видеосообщения
sv: Tal- och videomeddelanden
tr: Sesli ve Görüntülü Mesajlar
uk: Голосові та відеоповідомлення

# LocalCache
source: Other files
ar: الملفات الأخرى
be: Іншыя файлы
ca: Altres fitxers
de: Sonstige Dateien
es: Otros archivos
fa: سایر فایل‌ها
fi: Muut tiedostot
fr: Autres fichiers
id: Berkas lainnya
it: Altri file
ko: 다른 파일
ms: Lain-lain fail
nl: Overige bestanden
pl: Inne pliki
pt_br: Outros arquivos
ru: Другие файлы
sv: Andra filer
tr: Diğer Dosyalar
uk: Інші файли
uz: Boshqa fayllar
zh_cn: 其它文件
zh_tw: 其它文件

source: Local Database
ar: مسح قاعدة البيانات
be: Лакальная база даных
ca: Base de dades local
de: Lokale Datenbank
es: Base de datos local
fa: پایگاه داده محلی
fi: Tyhjennä paikallinen tietokanta
fr: Base de données locale
id: Pangkalan Data Lokal
it: Database locale
ko: 로컬 데이터베이스
ms: Pangkalan Data Tempatan
nl: Lokale database
pl: Lokalna baza danych
pt_br: Base de Dados Local
ru: Локальная база данных
sv: Rensa lokal databas
tr: Yerel Veritabanı
uk: Локальні дані
uz: Ichki maʼlumotlar bazasi
zh_cn: 本地数据库
zh_tw: 本地數據庫

# LocalDatabaseClear
source: Clear cached text messages?
ar: هل ترغب في مسح الرسائل النصية من الذاكرة المؤقتة؟
be: Выдаліць кэшаваныя паведамленні?
ca: Voleu eliminar els missatges de text de la memòria cau?
de: Textnachrichten-Cache leeren?
es: ¿Borrar los mensajes de texto en caché?
fa: پیام‌های متنی ذخیره شده پاک شوند؟
fi: Tyhjennetäänkö tekstiviestit välimuistista?
fr: Effacer les messages texte du cache ?
id: Bersihkan cache pesan teks?
it: Cancellare i messaggi salvati nella cache?
ko: 캐시된 문자 메시지를 비울까요?
ms: Padam kac mesej teks?
nl: Gecachet tekstberichten wissen?
pl: Wyczyścić zbuforowane wiadomości?
pt_br: Limpar todos os textos em cache?
ru: Очистить кэш текстовых сообщений?
sv: Rensa cachelagrade meddelanden?
tr: Önbelleğe alınmış metin mesajları temizlensin mi?
uk: Очистити кешовані текстові повідомлення?
uz: Keshlangan matn xabarlari tozalansinmi?
zh_cn: 清除缓存的消息记录？
zh_tw: 清除暫存的訊息記錄？

# LocalDatabaseClearText
source: Are you sure you want to clear cached text messages?
ar: هل ترغب حقًا في مسح الرسائل النصية من الذاكرة المؤقتة؟
be: Вы ўпэўнены, што хочаце выдаліць кэшаваныя паведамленні?
ca: Segur que voleu esborrar els missatges de text de la memòria cau?
de: Möchtest du wirklich den Textnachrichten-Cache leeren?
es: ¿Quieres borrar los mensajes de texto en caché?
fa: آیا از پاک کردن پیام‌های متنی ذخیره شده اطمینان دارید؟
fi: Haluatko varmasti tyhjentää välimuistissa olevat tekstiviestit?
fr: Voulez-vous vraiment effacer les messages texte en cache ?
id: Anda yakin ingin bersihkan cache pada pesan teks?
it: Vuoi davvero eliminare i messaggi di testo nella cache?
ko: 정말 캐시된 문자 메시지 비우시겠습니까?
ms: Anda pasti ingin padam kac untuk mesej teks?
nl: Gecachete tekstberichten wissen?
pl: Czy na pewno chcesz wyczyścić zbuforowane wiadomości?
pt_br: Deseja mesmo limpar as mensagens em cache?
ru: Вы точно хотите очистить кэш текстовых сообщений?
sv: Är du säker på att rensa cachade textmeddelanden.
tr: Önbelleğe alınmış metin mesajlarını silmek istediğinizden emin misiniz?
uk: Ви дійсно хочете очистити кеш текстових повідомлень?
uz: Haqiqatan ham keshlangan matn xabarlari tozalansinmi?

# LocalDatabaseClearTextTitle
source: Clear local database
ar: مسح قاعدة البيانات المحلية
be: Ачысціць лакальную базу даных
ca: Esborra la base de dades local
de: Lokale Datenbank leeren
es: Borrar base de datos local
fa: پاک کردن پایگاه داده محلی
fi: Tyhjennä paikallinen tietokanta
fr: Effacer la base de données locale
id: Hapus data basis lokal
it: Cancella database locale
ko: 로컬 데이터베이스 비우기
ms: Padam pengkalan data tempatan
nl: Lokale database wissen
pl: Wyczyść lokalną bazę danych
pt_br: Limpar base de dados local
ru: Очистить базу данных
sv: Töm lokal databas
tr: Yerel veritabanını temizle
uk: Очистити локальну базу даних
uz: Mahalliy maʼlumotlar bazasini tozalash

# LocalDatabaseInfo
source: Clearing the local database will delete the texts of cached messages and compress the database to save internal disk space. Telegram needs some data to work, so database size will not reach zero. This operation can take a few minutes to complete.
ar: مسح قاعدة البيانات المحلية سيؤدي لحذف الرسائل التي تم تنزيلها وضغط قاعدة البيانات لتوفير مساحة على جهازك. يحتاج تيليجرام لبعض البيانات ليعمل، لذا لن يصل حجم قاعدة البيانات إلى الصفر. قد تستغرق هذه العملية بضع دقائق لإكمالها.
be: Ачыстка лакальнай базы даных выдаліць кэшаваныя паведамленні і сцісне яе, каб захаваць месца на дыску. Telegram патрэбны некаторыя даныя, каб працаваць, таму цалкам выдаліць гэту базу немагчыма. Гэта дзеянне можа заняць некалькі хвілін.
ca: En esborrar la base de dades local, s'eliminaran els missatges a la memòria cau i aquesta es comprimirà per estalviar espai intern. El Telegram necessita certes dades per funcionar, així que la mida de la base de dades no arribarà a zero. Això pot trigar uns minuts.
de: Zwischengespeicherte Textnachrichten werden entfernt und die Datenbank optimiert, um Speicherplatz zurückzuerhalten. Auf Null lässt sich die Größe jedoch nicht reduzieren, da die App einige Daten für den laufenden Betrieb benötigt. Hinweis: Der Vorgang kann mehrere Minuten dauern.
es: Borrar la base de datos eliminará los mensajes en caché y comprimirá la base de datos para ahorrar espacio de almacenamiento. Telegram requiere algunos datos para funcionar, así que la base de datos nunca podrá llegar a cero. Esta operación puede tomar unos minutos.
fa: پاک کردن پایگاه داده محلی متن پیام‌های ذخیره شده را پاک کرده و پایگاه داده را برای حفظ فضای ذخیره‌سازی داخلی فشرده‌سازی می‌کند. تلگرام نیازمند مقداری داده برای کار کردن است، بنابراین حجم پایگاه داده صفر نخواهد شد. تکمیل این عملیات ممکن است چند دقیقه طول بکشد.
fi: Paikallisen tietokannan tyhjentäminen poistaa kaikkien välimuistissa olevien viestien tekstit ja pakkaa tietokannan säästääkseen tallennustilaa. Telegram tarvitsee hieman dataa toimiakseen, joten tietokanta ei tyhjene täysin. Tämän operaation valmistuminen voi viedä muutaman minuutin.
fr: Effacer la base de données locale supprimera les messages textes du cache et la compressera pour préserver l'espace disque. Sa taille ne sera jamais nulle, car certaines données sont nécessaires au fonctionnement de Telegram. Cette opération peut prendre plusieurs minutes.
id: Membersihkan basis data lokal akan menghapus pesan tersimpan dan memperkecil ukuran basis data untuk menghemat ruang penyimpanan internal. Telegram membutuhkan data untuk dapat bekerja, sehingga ukuran basis data tidak bisa kosong total. Operasi Ini bisa memakan waktu beberapa menit untuk selesai.
it: Cancellando il database locale, saranno eliminati i messaggi nella cache e il database sarà compresso per risparmiare spazio. Telegram ha bisogno di alcuni dati per funzionare, quindi il database non sarà azzerato. Questa operazione può richiedere alcuni minuti.
ko: 로컬 데이터베이스를 비우면 캐시된 메시지의 글을 지우고 데이터베이스를 압축해 내장 디스크 공간을 절약합니다. 텔레그램이 작동하는데 데이터가 어느 정도 필요하므로 데이터베이스 크기는 0이 되지 않습니다. 이 작업은 완료되기까지 몇 분 정도 걸릴 수 있습니다.
ms: Memadamkan pengkalan data tempatan akan hapus teks mesej dalam kac dan memadat data untuk jimat ruang disk dalaman. Telegram hanya perlu data kecil untuk berfungsi, jadi saiz data tidak akan menjadi sifar. Operasi ini akan mengambil masa beberapa minit.
nl: Het opschonen van de lokale database zal de tekst van gecachet berichten verwijderen en de database comprimeren om ruimte te besparen. Telegram heeft wat ruimte nodig om te kunnen functioneren, dus de databasegrootte zal nooit nul worden. Dit kan enkele minuten duren.
pl: Wyczyszczenie lokalnej bazy danych spowoduje usunięcie tekstów zbuforowanych wiadomości i skompresowanie bazy, by zaoszczędzić miejsce w pamięci wewnętrznej. Telegram do działania potrzebuje niektórych danych, więc rozmiar bazy danych nie osiągnie zero. Operacja ta może potrwać kilka minut.
pt_br: Limpar o banco de dados local apagará todos os textos das mensagens em cache e compactará a base de dados para economizar espaço. O Telegram precisa de alguns dados para trabalhar, então o tamanho do banco não vai chegar a zero. Essa operação pode demorar alguns minutos para ser concluída.
ru: Очистка локальной базы данных удалит кэш сообщений и сожмёт базу данных для экономии места на внутреннем накопителе. Некоторые данные нужны для работы Telegram, поэтому размер базы данных останется больше нуля. Эта операция может занять несколько минут.
sv: Rensning av den lokala databasen raderar texten i de cashade meddelandena och komprimera databasen för att spara diskutrymmet. Telegram behöver dock en del data för att fungera och databasen blir därför aldrig noll. Åtgärden kan ta ett par minuter att slutföra.
tr: Yerel veritabanının temizlenmesi, önbelleğe alınan mesaj metinlerini siler ve dahili depolama alanını temizlemek için veritabanını sıkıştırır. Telegram'ın çalışması için bazı verilere ihtiyacı vardır, bu nedenle veritabanı boyutu asla sıfıra inmez. Bu işlemin tamamlanması birkaç dakika sürebilir.
uk: Очищення локальної бази даних видалить тексти кешованих повідомлень і стисне базу даних, щоб зберегти внутрішній простір на диску. Для роботи Telegram потрібно трохи даних, тому розмір бази не буде нульовим. Ця операція може зайняти кілька хвилин.
uz: Ichki ma'lumotlar bazasini tozalash keshlangan xabarlar matnlarini o'chirish va ichki disk hajmini tejash uchun ma'lumotlar bazasini kichraytiradi. Telegram ishlashi uchun ba'zi bir ma'lumotlar kerak, shuning uchun baza hajmi hech qachon nolga teng bo'lmaydi. Tozalash bir necha daqiqa vaqt talab qilishi mumkin.
zh_cn: 清空本地数据库将删除缓存在本地的历史聊天记录并压缩数据库以节省存储空间。但由于 Telegram 需要一些数据来维持正常工作，所以数据库大小不会完全归零。 此操作需要一些时间来完成。
zh_tw: 清空本地數據庫將删除暫存在本地的歷史聊天記錄，並壓縮數據庫以節省儲存空間。但由於 Telegram 需要一些數據來維持正常工作，所以數據庫大小不會完全歸零。 此操作需要一些時間來完成。

# LocalDatabaseSize
source: {0} Telegram Local Database
ar: ⁨{0}⁩ قاعدة بيانات تيليجرام المحلية
be: {0} Лакальная база даных Telegram
ca: {0} de la base de dades del Telegram
de: {0} Telegrams lokale Datenbank
es: Base de datos local de Telegram • {0}
fa: ⁨{0}⁩ پایگاه داده محلی تلگرام
fi: {0} Telegramin paikallinen tietokanta
fr: {0} base de données locale de Telegram
id: {0} Telegram Pangkalan Data Lokal
it: {0} Database locale di Telegram
ko: {0} 텔레그램 로컬 데이터베이스
ms: {0} Pengkalan Data Telegram Tempatan
nl: {0} Telegram Lokale Database
pl: {0} Lokalna baza danych
pt_br: {0} Base de Dados Local
ru: {0} — база данных приложения
sv: {0} Telegram lokal databas
tr: {0} Telegram Yerel Veritabanı
uk: {0} локальна база даних Telegram
uz: {0} Telegram mahalliy maʼlumotlar bazasi
